{"schema":6,"addons":[{"id":"firefox@vid.io","icons":{"32":"https://addons.mozilla.org/user-media/addon_icons/2605/2605589-32.png?modified=4e6db8df","64":"https://addons.mozilla.org/user-media/addon_icons/2605/2605589-64.png?modified=4e6db8df","128":"https://addons.mozilla.org/user-media/addon_icons/2605/2605589-128.png?modified=4e6db8df"},"name":"vidIQ Vision for YouTube","version":"3.127.2","sourceURI":"https://addons.mozilla.org/firefox/downloads/file/4419827/vidiq_vision_youtube-3.127.2.xpi","homepageURL":"https://vidiq.com/","supportURL":"https://support.vidiq.com/en","amoListingURL":"https://addons.mozilla.org/en-US/firefox/addon/vidiq-vision-youtube/","description":"With insights and metrics that go beyond YouTube Analytics, vidIQ Vision delivers a comprehensive optimization report card for any YouTube video via your Firefox browser!","fullDescription":"Do you want to know how to get more YouTube views, or discover the secrets to success behind your favorite YouTube channels and videos? vidIQ Vision for Firefox is a suite of powerful tools that every creator needs access to if they want to build their audience on YouTube.\n\nWhether you’re a content creator, digital-first publisher, or a community or marketing manager you need to know:\n\n- What makes ‘Related Videos’ related?\n- How do videos get ranked in Search?\n- Where do ‘Recommended Videos’ come from?\n- What does good YouTube SEO look like?\n- How does social media fit into audience development?\n- What’s REALLY trending on YouTube\n- What content your audience is searching for\n- What content to double down on to get more YouTube views\n\nvidIQ's free Firefox extension provides these answers! We give you unique and authentic optimization data that can dramatically improve your videos’ performance, subscriber engagement, and promotion opportunities. vidIQ comes with a range of awesome features including:\n\nvidIQ Score – We rank every YouTube video according to a proprietary, cross-platform algorithm, and assign it an optimization score to predict its likelihood of promotion in Related Videos, Search, Recommended Videos, and more.\n\nChannel Audit - Have you ever wanted your very own Channel Audit, available 24/7? The YouTube Channel audit tool from vidIQ is one of the most powerful video marketing tools you can access. It quickly shows you how your content is performing, what’s working, and what issues need your attention.\n\nVideo Velocity – Measured in Views Per Hour, the Velocity feature allows you to identify which YouTube videos are gaining viral traction by seeing how quickly views are accelerating – in real-time!\n\nvidIQ Competitors Tool - Get insights into what your competitors are doing to rank highly and generate major views and subscribers. Our Competitors Tool allows you to follow the competition and leverage what they do right for your own YouTube strategy.\n\nAverage Watch Time – Get an exact idea of average viewing length for both your videos and those you’re watching.\n\nSocial Media Likes/Shares/Comments – See how many times someone on Facebook, Twitter, or Reddit has Liked, Shared or included your video’s URL in a comment.\n\nGet even more from vidIQ with our upgrade plans:\n\nvidIQ Pro - Get access to historical data to go back in time on popular videos, perform keyword research to get the best keywords for your next video, track your competition, and promote your videos via Description Campaigns.\n\nvidIQ Boost - Boost your videos’ SEO quickly and simply with vidIQ’s proprietary keyword recommendation engine to optimize tags, title, and description. Unlimited access to Pro tools and the ability to track and optimize more channels.\n\nVidIQ Boost+ - All the features of Boost PLUS personalized coaching for serious YouTube creators\n\nVision is just one part of vidIQ’s robust suite of video marketing software and YouTube audience development tools. For access to these and to view our industry White Paper, visit us @ http://www.vidIQ.com\n\nStay in touch:\n\nLike us on Facebook: http://facebook.com/vidIQapp\nFollow us on Twitter: http://twitter.com/vidIQ\nSubscribe to our YouTube channel: https://www.youtube.com/vidiq\nRead our blog: https://vidiq.com/blog/\n\nSupport:\n\nHave any questions or feedback? Please get in touch with our support team at contact@vidIQ.com","weeklyDownloads":1063,"type":"extension","creator":{"name":"vidIQ","url":"https://addons.mozilla.org/en-US/firefox/user/15429569/"},"developers":[],"screenshots":[{"url":"https://addons.mozilla.org/user-media/previews/full/263/263764.png?modified=1637628638","width":1280,"height":800,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/263/263764.jpg?modified=1637628638","thumbnailWidth":533,"thumbnailHeight":333,"caption":"Get more views with the #1 extension for YouTube creators"},{"url":"https://addons.mozilla.org/user-media/previews/full/263/263765.png?modified=1637628632","width":1280,"height":800,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/263/263765.jpg?modified=1637628632","thumbnailWidth":533,"thumbnailHeight":333,"caption":"AI powered video ideas with view prediction"},{"url":"https://addons.mozilla.org/user-media/previews/full/263/263766.png?modified=1637628631","width":1280,"height":800,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/263/263766.jpg?modified=1637628631","thumbnailWidth":533,"thumbnailHeight":333,"caption":"Find keywords to rank higher in YouTube search"},{"url":"https://addons.mozilla.org/user-media/previews/full/263/263767.png?modified=1637628633","width":1280,"height":800,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/263/263767.jpg?modified=1637628633","thumbnailWidth":533,"thumbnailHeight":333,"caption":"Optimize your videos to get more views"},{"url":"https://addons.mozilla.org/user-media/previews/full/263/263768.png?modified=1637628636","width":1280,"height":800,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/263/263768.jpg?modified=1637628636","thumbnailWidth":533,"thumbnailHeight":333,"caption":"Trusted by 5M influencers"}],"contributionURL":"","averageRating":4.2062,"reviewCount":63,"reviewURL":"https://addons.mozilla.org/en-US/firefox/addon/vidiq-vision-youtube/reviews/","updateDate":1737663230000}]}